## DataFrame 누락데이터 처리하기 
    누락데이타 값 처리하기 - dropna(), fillna(), isnull(), notnull()

In [ ]:
'''
    판다스는 누락된 모든 데이타를 NaN으로 처리한다. 
    dropna() : NaN 값이 하나라도 있으면 해당 row를 삭제 
    dropna(how='all') : 모두 NaN값인 row 를 삭제
    dropna(how='any') : NaN 값이 하나라도 있으면 해당 row를 삭제
    dropna(thresh=3) : NaN을 제외한 결측 개수 보다 적은것 삭제
    
    fillna() : 누락된 데이타를 다른값으로 채움
    
    isnull()
    notnull()
    
'''

In [3]:
import numpy as np
import pandas as pd 

from pandas import Series, DataFrame
import matplotlib.pyplot as plt


from numpy import nan as NA

In [5]:
df = DataFrame([[1,6.5,3],[1,NA,NA],[NA, NA, NA], [NA, 6.5, 3]])
df

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [35]:
#  dropna()
removeNa = df.dropna() # 누락값이 하나라도 있으면 삭제하는게 default
removeNa
df # 원본은 유지한다. 

df.dropna(how='all') # 모든 데이타가 누락데이타일때만 삭제
df.dropna(how='any')

df.dropna(thresh=1) # NaN을 제외한 결측 개수 보다 적은것 삭제

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

## DataFrame 누락데이터 처리하기 
    누락된 값 채우기 fillna()

In [26]:
df.fillna(0) # 기본적으론 원본이 유지됨 
df.fillna(df.mean())
df.fillna(value=77)

      0     1     2
0   1.0   6.5   3.0
1   1.0  77.0  77.0
2  77.0  77.0  77.0
3  77.0   6.5   3.0

In [27]:
df.fillna(method='ffill') # 위의 인덱스를 따라서 채워짐

     0    1    2
0  1.0  6.5  3.0
1  1.0  6.5  3.0
2  1.0  6.5  3.0
3  1.0  6.5  3.0

     0    1    2
0  1.0  6.5  3.0
1  1.0  6.5  3.0
2  1.0  6.5  3.0
3  1.0  6.5  3.0